The were no errors in the tests except the expected items in the upgrade tests.

```hcl
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185: Terraform used the selected providers to generate the following execution
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185: plan. Resource actions are indicated with the following symbols:
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:   + create
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185: -/+ destroy and then create replacement
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185: 
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185: Terraform will perform the following actions:
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185: 
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:   # module.icd_redis.ibm_resource_key.service_credentials["redis_editor"] will be created
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:   + resource "ibm_resource_key" "service_credentials" {
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       + account_id            = (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       + created_at            = (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       + created_by            = (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       + credentials           = (sensitive value)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       + credentials_json      = (sensitive value)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       + crn                   = (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       + deleted_at            = (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       + deleted_by            = (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       + guid                  = (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       + iam_compatible        = (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       + id                    = (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       + name                  = "redis_editor"
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       + onetime_credentials   = (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       + resource_group_id     = (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       + resource_instance_id  = "crn:v1:bluemix:public:databases-for-redis:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:6a302c2c-5586-49a6-bb80-ead40bb44f20::"
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       + resource_instance_url = (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       + role                  = "Editor"
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       + source_crn            = (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       + state                 = (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       + status                = (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       + updated_at            = (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       + updated_by            = (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       + url                   = (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:     }
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185: 
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:   # module.icd_redis.ibm_resource_key.service_credentials["redis_viewer"] must be replaced
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185: -/+ resource "ibm_resource_key" "service_credentials" {
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       ~ account_id            = "abac0df06b644a9cabc6e44f55b3880e" -> (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       ~ created_at            = "2024-08-26T22:48:37.383Z" -> (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       ~ created_by            = "IBMid-666000KAO3" -> (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       ~ credentials           = (sensitive value)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       ~ credentials_json      = (sensitive value)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       ~ crn                   = "crn:v1:bluemix:public:databases-for-redis:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:6a302c2c-5586-49a6-bb80-ead40bb44f20:resource-key:b29d9171-af88-4673-a40c-62cd1c53e1ad" -> (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       + deleted_at            = (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       + deleted_by            = (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       ~ guid                  = "b29d9171-af88-4673-a40c-62cd1c53e1ad" -> (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       ~ iam_compatible        = false -> (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       ~ id                    = "crn:v1:bluemix:public:databases-for-redis:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:6a302c2c-5586-49a6-bb80-ead40bb44f20:resource-key:b29d9171-af88-4673-a40c-62cd1c53e1ad" -> (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:         name                  = "redis_viewer"
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       ~ onetime_credentials   = false -> (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       ~ resource_group_id     = "4e2258b7ca794763b7a61a8e114661c6" -> (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       ~ resource_instance_url = "/v2/resource_instances/6a302c2c-5586-49a6-bb80-ead40bb44f20" -> (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       ~ role                  = "Editor" -> "Viewer" # forces replacement
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       ~ source_crn            = "crn:v1:bluemix:public:databases-for-redis:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:6a302c2c-5586-49a6-bb80-ead40bb44f20::" -> (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       ~ state                 = "active" -> (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       ~ status                = "active" -> (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       ~ updated_at            = "2024-08-26T22:48:37.383Z" -> (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       + updated_by            = (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:       ~ url                   = "/v2/resource_keys/b29d9171-af88-4673-a40c-62cd1c53e1ad" -> (known after apply)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:         # (1 unchanged attribute hidden)
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185:     }
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185: 
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185: Plan: 2 to add, 0 to change, 1 to destroy.
TestRunAdvancedExampleUpgrade 2024-08-26T22:49:28Z command.go:185: 
```

It is appropriate to skip the upgrade test.